In [293]:
import pandas as pd
import datetime

In [294]:
df=pd.read_csv('../final/lucknow_high_anomalies.csv',header=None)

In [295]:
df=df[0].tolist()

In [296]:
l=[]

In [297]:
for i in df:
    x=pd.date_range(i,periods=29)
    l.extend(x)

In [298]:
p=[]
for i in l:
    p.append(str(i)[:10])

In [299]:
df=pd.DataFrame(p)

In [300]:
df.head()

            0
0  2008-03-13
1  2008-03-14
2  2008-03-15
3  2008-03-16
4  2008-03-17

In [301]:
dx=pd.read_csv('../../Processed/lucknow_retail.csv',header=None)
f=[]
for i in range(len(df)):
    x=df[0][i]
    k=float(dx[dx[0]==x][1])
    #print(k)
    #f.append(float(str(k)[0:11]))
    f.append(k)
df['retail']=f

In [302]:
df.head()

            0  retail
0  2008-03-13   600.0
1  2008-03-14   600.0
2  2008-03-15   600.0
3  2008-03-16   650.0
4  2008-03-17   700.0

In [303]:
dx=pd.read_csv('../../Processed/lucknow_mandi.csv',header=None)
f=[]
for i in range(len(df)):
    x=df[0][i]
    k=float(dx[dx[0]==x][1])
    #f.append(float(str(k)[6:11]))
    f.append(k)
df['mandi']=f

In [304]:
df.head()

            0  retail  mandi
0  2008-03-13   600.0  450.0
1  2008-03-14   600.0  450.0
2  2008-03-15   600.0  450.0
3  2008-03-16   650.0  450.0
4  2008-03-17   700.0  450.0

In [305]:
dx=pd.read_csv('../../Processed/lucknow_arrival.csv',header=None)
f=[]
for i in range(len(df)):
    x=df[0][i]
    k=float(dx[dx[0]==x][1])
    #f.append(float(str(k)[7:10]))
    f.append(k)
df['arrival']=f

In [306]:
df.head()

            0  retail  mandi  arrival
0  2008-03-13   600.0  450.0    110.0
1  2008-03-14   600.0  450.0    109.5
2  2008-03-15   600.0  450.0    108.0
3  2008-03-16   650.0  450.0    103.0
4  2008-03-17   700.0  450.0    104.5

In [307]:
p=[]
l=len(df)//29
for i in range(11,l+11):
        p.extend([i]*29)

In [308]:
df['events']=p

In [309]:
df.to_csv('new/lucknow_high_anomalies_data.csv',index=None)

In [310]:
df.head()

            0  retail  mandi  arrival  events
0  2008-03-13   600.0  450.0    110.0      11
1  2008-03-14   600.0  450.0    109.5      11
2  2008-03-15   600.0  450.0    108.0      11
3  2008-03-16   650.0  450.0    103.0      11
4  2008-03-17   700.0  450.0    104.5      11

In [311]:
df.tail()

              0  retail  mandi  arrival  events
546  2017-04-21   800.0  495.0    160.0      29
547  2017-04-22   800.0  700.0    120.0      29
548  2017-04-23   800.0  500.0    120.0      29
549  2017-04-24   800.0  500.0    120.0      29
550  2017-04-25   800.0  500.0    100.0      29

In [67]:
df1=pd.read_csv('../final/kolkata_high_anomalies.csv',header=None)
df2=pd.read_csv('../final/lucknow_high_anomalies.csv',header=None)

In [68]:
l=[]

In [69]:
l.extend(df1[2].tolist())
l.extend(df2[2].tolist())

In [70]:
(pd.DataFrame(l)).to_csv('potato_high_anomalies.csv')

In [71]:
len(l)

30